In [ ]:
#十分钟了解pandas 0.20.3

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

# Intro to Data Structures

# Series

In [ ]:
# Series是一个可容纳任何数据类型（整数，字符串，浮点数，Python对象，etc）的一维标签数组
# s = pd.Series(data, index=index)

In [5]:
#创建Series，通过一列值，默认为整数index

In [6]:
s = pd.Series([1,3,5,np.nan,9,11])

In [7]:
s

0     1.0
1     3.0
2     5.0
3     NaN
4     9.0
5    11.0
dtype: float64

In [8]:
np.random.randn(5)

array([ 1.18344417,  0.29834635,  0.89204103, -0.29921991,  0.65773461])

In [ ]:
#自定义index

In [10]:
s = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])

In [11]:
s

a   -0.254293
b    0.236095
c    0.421593
d    2.290145
e    2.459604
dtype: float64

In [12]:
s.index

Index([u'a', u'b', u'c', u'd', u'e'], dtype='object')

In [13]:
s.values

array([-0.25429268,  0.23609543,  0.42159298,  2.29014456,  2.45960369])

In [21]:
s[0]

-0.25429268106185537

In [22]:
s[:3]

a   -0.254293
b    0.236095
c    0.421593
dtype: float64

In [23]:
s[s>s.median()]

d    2.290145
e    2.459604
dtype: float64

In [24]:
s[[4,3,1]]

e    2.459604
d    2.290145
b    0.236095
dtype: float64

In [25]:
np.exp(s)

a     0.775465
b     1.266295
c     1.524388
d     9.876365
e    11.700174
dtype: float64

In [26]:
s['a']

-0.25429268106185537

In [29]:
s['e'] = 12.

In [30]:
s

a    -0.254293
b     0.236095
c     0.421593
d     2.290145
e    12.000000
dtype: float64

In [31]:
'e' in s

True

In [32]:
# 访问不存在的标签

In [34]:
s['f'] #异常

KeyError: 'f'

In [35]:
s.get('f') #返回None，不抛出异常

In [36]:
s.get('f', np.nan) #指定返回值

nan

In [14]:
# data from dict

In [15]:
d = {'a':0., 'b':1., 'c':2.}

In [17]:
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [18]:
##指定index输出顺序

In [19]:
pd.Series(d, index=['b','c','d','a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [20]:
#NaN == not a number， pandas中标准missing数据标记

In [ ]:
# 向量运算

In [37]:
s

a    -0.254293
b     0.236095
c     0.421593
d     2.290145
e    12.000000
dtype: float64

In [38]:
s + s

a    -0.508585
b     0.472191
c     0.843186
d     4.580289
e    24.000000
dtype: float64

In [39]:
s * 2

a    -0.508585
b     0.472191
c     0.843186
d     4.580289
e    24.000000
dtype: float64

In [40]:
s[1:] + s[:-1] #标签相同的才会相加

a         NaN
b    0.472191
c    0.843186
d    4.580289
e         NaN
dtype: float64

In [46]:
pd.DataFrame.dropna(pd.DataFrame(s[1:] + s[:-1])) #去掉Nan行

          0
b  0.472191
c  0.843186
d  4.580289

In [47]:
ss = pd.Series(np.random.randn(5), name="something") #名字属性

In [51]:
ss

0    0.799330
1    1.101634
2    2.736554
3   -0.144663
4   -0.061870
Name: something, dtype: float64

In [53]:
ss.name

'something'

In [80]:
ss2 = ss.rename("different")  #ss和ss2指向不同对象

In [81]:
ss.name

'something'

In [55]:
ss2.name

'different'

# DataFrame

In [ ]:
# DataFrame 是一个二维标记数据结构

In [ ]:
# data from dict of Series or dicts

In [56]:
d = {
    'one': pd.Series([1.,2.,3.], index=['a','b','c']),
    'two': pd.Series([1.,2.,3.,4.], index=['a','b','c','d'])
}

In [57]:
df = pd.DataFrame(d)

In [58]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [59]:
pd.DataFrame(d, index=['d','b','a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [61]:
pd.DataFrame(d, index=['d','b','a'], columns=['two', 'three']) # 可指定index和columns的值和顺序，若不存在相关标记，值为NaN

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [62]:
# data from dict of ndarrays / lists

In [63]:
d = {
    'one': [1.,2.,3.,4.],
    'two': [4.,3.,2.,1.]
}

In [64]:
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [65]:
pd.DataFrame(d, index=['a','b','c','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [66]:
# data from structured or record array

In [67]:
# data from a list of dict

In [68]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [69]:
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [70]:
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [71]:
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

In [72]:
# data from a dict of tuples

In [73]:
# data from a series

In [74]:
# missing data -- np.nan

In [75]:
# DataFrame.from_dict

In [76]:
# DataFrame.from_records

In [77]:
# DataFrame.from_items

In [78]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])])

   A  B
0  1  4
1  2  5
2  3  6

In [79]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])],
                       orient='index', columns=['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      6

In [82]:
# 列的选择，添加，删除

In [84]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [85]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [86]:
df['three'] = df['one'] * df['two']

In [87]:
df['flag'] = df['one'] > 2

In [88]:
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [89]:
del df['two']

In [90]:
three = df.pop('three')

In [91]:
df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

In [92]:
df['foo'] = 'bar'

In [93]:
df

   one   flag  foo
a  1.0  False  bar
b  2.0  False  bar
c  3.0   True  bar
d  NaN  False  bar

In [94]:
df['one_trunc'] = df['one'][:2]

In [95]:
df

   one   flag  foo  one_trunc
a  1.0  False  bar        1.0
b  2.0  False  bar        2.0
c  3.0   True  bar        NaN
d  NaN  False  bar        NaN

In [96]:
df.insert(1, 'bar', df['one'])

In [97]:
df

   one  bar   flag  foo  one_trunc
a  1.0  1.0  False  bar        1.0
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN
d  NaN  NaN  False  bar        NaN

In [98]:
# 方法链赋予新列

In [99]:
# 假设 file = pd.read_csv(), file.head()查看前几条  file.info()查看数据信息
# file.assign(new_column_name = file['one'] / file['two']).head() 创建新列后显示
# file.assign(new_column_name = lambda x: (x['one'] / x['two']).head() 同上
# assign函数返回的是数据的一份拷贝
# file.query('len > 4')
#     .assign(one = lambda x: x.oneWid / x.oneHei,
#             two = lambda x: x.twoWid / x.twoHei)
#     .plot(kind='scatter', x='one', y='two)
# query函数返回满足条件的数据，并创建两列新值，新值数据取决于原数据中的运算结果，最后plot函数输出图像

In [100]:
# indexing与selecting

In [101]:
# Operation                  Syntax         Result
# select column              df[col]        series     
# select row by label        df.loc[label]  series
# select row by integer loc  df.iloc[loc]   series
# slice rows                 df[5:10]       dataframe
# select rows by bool vector df[bool_vec]   dataframe

In [103]:
df

   one  bar   flag  foo  one_trunc
a  1.0  1.0  False  bar        1.0
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN
d  NaN  NaN  False  bar        NaN

In [102]:
df.loc['b'] # b是index

one              2
bar              2
flag         False
foo            bar
one_trunc        2
Name: b, dtype: object

In [112]:
# df[0], df['b'] 会直接报错

In [109]:
df.iloc[3]

one            NaN
bar            NaN
flag         False
foo            bar
one_trunc      NaN
Name: d, dtype: object

In [106]:
df.loc['c']

one             3
bar             3
flag         True
foo           bar
one_trunc     NaN
Name: c, dtype: object

In [107]:
df['flag']

a    False
b    False
c     True
d    False
Name: flag, dtype: bool

In [113]:
# 赋值与运算

In [114]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [115]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [116]:
df + df2

          A         B         C   D
0  1.374441 -0.167647  0.327347 NaN
1 -2.906335  0.436467  1.357833 NaN
2  1.097775 -0.322652  3.789590 NaN
3 -0.228270  1.488370  0.673459 NaN
4  2.367189  0.412873 -0.168071 NaN
5 -0.671809 -2.011717  1.975986 NaN
6 -1.370560  0.452548  0.322048 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [117]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -1.762808  1.024154  1.666511  1.207457
2  1.494038  0.690124  2.952202  1.181760
3 -0.657848  3.452406  0.793819  0.669682
4  0.654540  1.317948  1.095091  0.575547
5 -1.373068 -0.147904  2.829896  2.845411
6 -1.750096  0.780279  1.821889  0.354873
7 -1.769365 -0.080286 -1.091398  1.256995
8 -1.141776  0.850379  0.879292  0.793362
9 -0.519423  0.730906  0.307412  1.124434

In [118]:
index = pd.date_range('1/1/2000', periods=8)

In [120]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=list('ABC'))

In [121]:
df

                   A         B         C
2000-01-01  0.712638  0.025764  0.242922
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-03  1.429138 -0.365615  0.907741
2000-01-04 -0.664372 -0.034173 -1.243213
2000-01-05 -0.111208  0.218877  0.300863
2000-01-06 -0.786934 -0.893949  0.592353
2000-01-07 -0.171932 -0.713526  1.779601
2000-01-08  0.494393 -0.834646  1.055227

In [122]:
type(df['A'])

pandas.core.series.Series

In [123]:
df - df['A'] #wrong

,2000-01-01 00:00:00,2000-01-02 00:00:00,2000-01-03 00:00:00,2000-01-04 00:00:00,2000-01-05 00:00:00,2000-01-06 00:00:00,2000-01-07 00:00:00,2000-01-08 00:00:00,A,B,C
2000-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [124]:
df.sub(df['A'], axis=0)

              A         B         C
2000-01-01  0.0 -0.686874 -0.469716
2000-01-02  0.0  0.316590  1.083562
2000-01-03  0.0 -1.794753 -0.521397
2000-01-04  0.0  0.630199 -0.578841
2000-01-05  0.0  0.330085  0.412071
2000-01-06  0.0 -0.107014  1.379287
2000-01-07  0.0 -0.541594  1.951533
2000-01-08  0.0 -1.329039  0.560835

In [125]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [126]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [127]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [128]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [129]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [130]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [131]:
df[:5]

                   A         B         C
2000-01-01  0.712638  0.025764  0.242922
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-03  1.429138 -0.365615  0.907741
2000-01-04 -0.664372 -0.034173 -1.243213
2000-01-05 -0.111208  0.218877  0.300863

In [132]:
df[:5].T  # 转换

   2000-01-01  2000-01-02  2000-01-03  2000-01-04  2000-01-05
A    0.712638   -0.664088    1.429138   -0.664372   -0.111208
B    0.025764   -0.347498   -0.365615   -0.034173    0.218877
C    0.242922    0.419474    0.907741   -1.243213    0.300863

# Object Creation

# Viewing Data

In [133]:
df

                   A         B         C
2000-01-01  0.712638  0.025764  0.242922
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-03  1.429138 -0.365615  0.907741
2000-01-04 -0.664372 -0.034173 -1.243213
2000-01-05 -0.111208  0.218877  0.300863
2000-01-06 -0.786934 -0.893949  0.592353
2000-01-07 -0.171932 -0.713526  1.779601
2000-01-08  0.494393 -0.834646  1.055227

In [134]:
df.sort_index(axis=1, ascending=False)  #列标排序

                   C         B         A
2000-01-01  0.242922  0.025764  0.712638
2000-01-02  0.419474 -0.347498 -0.664088
2000-01-03  0.907741 -0.365615  1.429138
2000-01-04 -1.243213 -0.034173 -0.664372
2000-01-05  0.300863  0.218877 -0.111208
2000-01-06  0.592353 -0.893949 -0.786934
2000-01-07  1.779601 -0.713526 -0.171932
2000-01-08  1.055227 -0.834646  0.494393

In [135]:
df.sort_values(by='B') # 按照B列值大小排序

                   A         B         C
2000-01-06 -0.786934 -0.893949  0.592353
2000-01-08  0.494393 -0.834646  1.055227
2000-01-07 -0.171932 -0.713526  1.779601
2000-01-03  1.429138 -0.365615  0.907741
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-04 -0.664372 -0.034173 -1.243213
2000-01-01  0.712638  0.025764  0.242922
2000-01-05 -0.111208  0.218877  0.300863

# Selection

In [136]:
df['A']

2000-01-01    0.712638
2000-01-02   -0.664088
2000-01-03    1.429138
2000-01-04   -0.664372
2000-01-05   -0.111208
2000-01-06   -0.786934
2000-01-07   -0.171932
2000-01-08    0.494393
Freq: D, Name: A, dtype: float64

In [137]:
df[0:3]

                   A         B         C
2000-01-01  0.712638  0.025764  0.242922
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-03  1.429138 -0.365615  0.907741

In [138]:
df['20000102':'20000104']

                   A         B         C
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-03  1.429138 -0.365615  0.907741
2000-01-04 -0.664372 -0.034173 -1.243213

In [142]:
df.loc['20000104']

A   -0.664372
B   -0.034173
C   -1.243213
Name: 2000-01-04 00:00:00, dtype: float64

In [141]:
df.loc[:, ['A','B']]

                   A         B
2000-01-01  0.712638  0.025764
2000-01-02 -0.664088 -0.347498
2000-01-03  1.429138 -0.365615
2000-01-04 -0.664372 -0.034173
2000-01-05 -0.111208  0.218877
2000-01-06 -0.786934 -0.893949
2000-01-07 -0.171932 -0.713526
2000-01-08  0.494393 -0.834646

In [143]:
df.loc['20000102':'20000104',['C','B']]

                   C         B
2000-01-02  0.419474 -0.347498
2000-01-03  0.907741 -0.365615
2000-01-04 -1.243213 -0.034173

In [144]:
df.iloc[3]

A   -0.664372
B   -0.034173
C   -1.243213
Name: 2000-01-04 00:00:00, dtype: float64

In [147]:
df.iloc[[1,2,3],[2,0]]

                   C         A
2000-01-02  0.419474 -0.664088
2000-01-03  0.907741  1.429138
2000-01-04 -1.243213 -0.664372

In [148]:
df.iloc[1:3,:]

                   A         B         C
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-03  1.429138 -0.365615  0.907741

In [149]:
df[df.A>0]

                   A         B         C
2000-01-01  0.712638  0.025764  0.242922
2000-01-03  1.429138 -0.365615  0.907741
2000-01-08  0.494393 -0.834646  1.055227

In [150]:
df2 = df.copy()

In [153]:
df2['E'] = ['one', 'one','two','three','four','three','nine','ten']

In [154]:
df2

                   A         B         C      E
2000-01-01  0.712638  0.025764  0.242922    one
2000-01-02 -0.664088 -0.347498  0.419474    one
2000-01-03  1.429138 -0.365615  0.907741    two
2000-01-04 -0.664372 -0.034173 -1.243213  three
2000-01-05 -0.111208  0.218877  0.300863   four
2000-01-06 -0.786934 -0.893949  0.592353  three
2000-01-07 -0.171932 -0.713526  1.779601   nine
2000-01-08  0.494393 -0.834646  1.055227    ten

In [155]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C     E
2000-01-03  1.429138 -0.365615  0.907741   two
2000-01-05 -0.111208  0.218877  0.300863  four

In [156]:
# dropna(how='any) 去掉Nan行
# fillna(value=5) 填充Nan
# isnull(df) 保留为boolean值

In [157]:
df

                   A         B         C
2000-01-01  0.712638  0.025764  0.242922
2000-01-02 -0.664088 -0.347498  0.419474
2000-01-03  1.429138 -0.365615  0.907741
2000-01-04 -0.664372 -0.034173 -1.243213
2000-01-05 -0.111208  0.218877  0.300863
2000-01-06 -0.786934 -0.893949  0.592353
2000-01-07 -0.171932 -0.713526  1.779601
2000-01-08  0.494393 -0.834646  1.055227

In [158]:
df.mean() # 列平均值

A    0.029704
B   -0.368096
C    0.506871
dtype: float64

In [159]:
df.mean(1) # 行平均值

2000-01-01    0.327108
2000-01-02   -0.197370
2000-01-03    0.657088
2000-01-04   -0.647253
2000-01-05    0.136178
2000-01-06   -0.362843
2000-01-07    0.298047
2000-01-08    0.238324
Freq: D, dtype: float64

In [160]:
df['A']

2000-01-01    0.712638
2000-01-02   -0.664088
2000-01-03    1.429138
2000-01-04   -0.664372
2000-01-05   -0.111208
2000-01-06   -0.786934
2000-01-07   -0.171932
2000-01-08    0.494393
Freq: D, Name: A, dtype: float64

In [161]:
df['A'].shift(2) #数据往下偏移2行

2000-01-01         NaN
2000-01-02         NaN
2000-01-03    0.712638
2000-01-04   -0.664088
2000-01-05    1.429138
2000-01-06   -0.664372
2000-01-07   -0.111208
2000-01-08   -0.786934
Freq: D, Name: A, dtype: float64

In [164]:
# apple()函数应用外部函数

In [165]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [166]:
s

0    2
1    5
2    5
3    2
4    0
5    2
6    0
7    3
8    1
9    2
dtype: int64

In [167]:
s.value_counts()

2    4
5    2
0    2
3    1
1    1
dtype: int64